In [ ]:
# OPL Stack for Gen Ai , open ai and pinecone and langchain with this combination we can make Gen Ai complex applications
# Open Ai, PineCone and Langchain OPL stack 
# will be covering Pandas 
# Filtering on Pandas
# group by
# Data Wraggling - joing data 
# Data Visulization

# Pandas
* filter
* sorting
* useful methods
* groupby
* merge

In [2]:
# we will generate data from Chat Gpt4 
# Prompt : Create 10 students dataFrame python static type with these columns : roll no : int, name: str, fName : str, course: str, date of Admission ; date
# fee : int
# whenever a data set is being made, we can tell numeric value directly
# but for date iso format of date says that biggest figure in date comes first and type was in string so we did type casting 

import pandas as pd
from datetime import datetime

# Define the data as a list of dictionaries with 10 student records
students_data = [
    {'roll_no': 1, 'name': 'Alice', 'father': 'Bob', 'course': 'Physics', 'date_of_admission': '2023-01-10', 'fee': 10000},
    {'roll_no': 2, 'name': 'Brian', 'father': 'Steve', 'course': 'Chemistry', 'date_of_admission': '2023-02-12', 'fee': 11000},
    {'roll_no': 3, 'name': 'Chloe', 'father': 'Tim', 'course': 'Biology', 'date_of_admission': '2023-03-14', 'fee': 12000},
    {'roll_no': 4, 'name': 'David', 'father': 'Rick', 'course': 'Mathematics', 'date_of_admission': '2023-04-10', 'fee': 13000},
    {'roll_no': 5, 'name': 'Eva', 'father': 'John', 'course': 'Computer Science', 'date_of_admission': '2023-05-16', 'fee': 14000},
    {'roll_no': 6, 'name': 'Frank', 'father': 'Tom', 'course': 'Economics', 'date_of_admission': '2023-06-21', 'fee': 15000},
    {'roll_no': 7, 'name': 'Grace', 'father': 'Harry', 'course': 'History', 'date_of_admission': '2023-07-25', 'fee': 16000},
    {'roll_no': 8, 'name': 'Henry', 'father': 'Charles', 'course': 'Geography', 'date_of_admission': '2023-08-17', 'fee': 17000},
    {'roll_no': 9, 'name': 'Isabel', 'father': 'Oliver', 'course': 'English', 'date_of_admission': '2023-09-10', 'fee': 18000},
    {'roll_no': 10, 'name': 'Jack', 'father': 'Noah', 'course': 'Art', 'date_of_admission': '2023-10-05', 'fee': 19000},
]

# Create the DataFrame
students_df : pd.DataFrame = pd.DataFrame(students_data)

# Convert 'date_of_admission' to datetime
students_df['date_of_admission'] = pd.to_datetime(students_df['date_of_admission']) # pandas method to date this function converts to date time and is very important without converting we cannot apply any functionality 

# Show the DataFrame
display(students_df)

# Verify the data types
display(students_df.info())

   roll_no    name   father            course date_of_admission    fee
0        1   Alice      Bob           Physics        2023-01-10  10000
1        2   Brian    Steve         Chemistry        2023-02-12  11000
2        3   Chloe      Tim           Biology        2023-03-14  12000
3        4   David     Rick       Mathematics        2023-04-10  13000
4        5     Eva     John  Computer Science        2023-05-16  14000
5        6   Frank      Tom         Economics        2023-06-21  15000
6        7   Grace    Harry           History        2023-07-25  16000
7        8   Henry  Charles         Geography        2023-08-17  17000
8        9  Isabel   Oliver           English        2023-09-10  18000
9       10    Jack     Noah               Art        2023-10-05  19000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   roll_no            10 non-null     int64
 1   name               10 non-null     object
 2   father             10 non-null     object
 3   course             10 non-null     object
 4   date_of_admission  10 non-null     datetime64[ns]
 5   fee                10 non-null     int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 612.0+ bytes

None

In [12]:
import pandera as pa
from pandera.typing import Series
from datetime import datetime
import pandas as pd

# Data for 10 students
students_data = [
    {'roll_no': 1, 'name': 'Alice', 'father': 'Bob', 'course': 'Physics', 'date_of_admission': '2023-01-10', 'fee': 10000},
    {'roll_no': 2, 'name': 'Brian', 'father': 'Steve', 'course': 'Chemistry', 'date_of_admission': '2023-02-12', 'fee': 11000},
    {'roll_no': 3, 'name': 'Chloe', 'father': 'Tim', 'course': 'Biology', 'date_of_admission': '2023-03-14', 'fee': 12000},
    {'roll_no': 4, 'name': 'David', 'father': 'Rick', 'course': 'Physics', 'date_of_admission': '2023-04-10', 'fee': 13000},
    {'roll_no': 5, 'name': 'Eva', 'father': 'John', 'course': 'Physics', 'date_of_admission': '2023-05-16', 'fee': 14000},
    {'roll_no': 6, 'name': 'Frank', 'father': 'Tom', 'course': 'Economics', 'date_of_admission': '2023-06-21', 'fee': 15000},
    {'roll_no': 7, 'name': 'Grace', 'father': 'Harry', 'course': 'History', 'date_of_admission': '2023-07-25', 'fee': 16000},
    {'roll_no': 8, 'name': 'Henry', 'father': 'Charles', 'course': 'Geography', 'date_of_admission': '2023-08-17', 'fee': 17000},
    {'roll_no': 9, 'name': 'Isabel', 'father': 'Oliver', 'course': 'English', 'date_of_admission': '2023-09-10', 'fee': 18000},
    {'roll_no': 10, 'name': 'Jack', 'father': 'Noah', 'course': 'Art', 'date_of_admission': '2023-10-05', 'fee': 19000},
]

# Create the DataFrame
students_df = pd.DataFrame(students_data)

# Convert 'date_of_admission' to datetime
students_df['date_of_admission'] = pd.to_datetime(students_df['date_of_admission'])

# Define the schema using SchemaModel
class StudentSchema(pa.SchemaModel):
    roll_no: Series[int] = pa.Field(ge=1)
    name: Series[str] = pa.Field(nullable=False)
    father: Series[str] = pa.Field(nullable=False)
    course: Series[str] = pa.Field(nullable=False)
    date_of_admission: Series[datetime] = pa.Field(le=datetime.now())
    fee: Series[int] = pa.Field(ge=0)

    class Config:
        coerce = True  # Automatically coerce types if possible
        strict = True  # Ensure all columns are accounted for in the schema

# Validate the DataFrame
validated_df = StudentSchema.validate(students_df)

# Display the validated DataFrame
print(validated_df)

AttributeError: module 'pandera' has no attribute 'SchemaModel'

In [11]:
pip install --upgrade pandera

Requirement already satisfied: pandera in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (0.20.3)
Requirement already satisfied: multimethod<=1.10.0 in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (from pandera) (1.10)
Requirement already satisfied: numpy>=1.19.0 in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (from pandera) (1.26.4)
Requirement already satisfied: packaging>=20.0 in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (from pandera) (24.1)
Requirement already satisfied: pandas>=1.2.0 in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (from pandera) (2.2.2)
Requirement already satisfied: pydantic in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (from pandera) (2.8.2)
Requirement already satisfied: typeguard in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (from pandera) (4.3.0)
Requirement already satisfied: typing-inspect>=0.6.0 in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (from pandera) (0.9.0)
Requirement already satisfied: wrapt in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (from pandera) (1.16.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (from pandas>=1.2.0->pandera) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (from pandas>=1.2.0->pandera) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (from pandas>=1.2.0->pandera) (2024.1)
Requirement already satisfied: mypy-extensions>=0.3.0 in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (from typing-inspect>=0.6.0->pandera) (1.0.0)
Requirement already satisfied: typing-extensions>=3.7.4 in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (from typing-inspect>=0.6.0->pandera) (4.12.2)
Requirement already satisfied: annotated-types>=0.4.0 in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (from pydantic->pandera) (0.7.0)
Requirement already satisfied: pydantic-core==2.20.1 in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (from pydantic->pandera) (2.20.1)
Requirement already satisfied: six>=1.5 in c:\users\lenovo\anaconda3\envs\python12\lib\site-packages (from python-dateutil>=2.8.2->pandas>=1.2.0->pandera) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [13]:
import pandera as pa
from pandera import Column, Check
import pandas as pd
from datetime import datetime

# Data for 10 students
students_data = [
    {'roll_no': 1, 'name': 'Alice', 'father': 'Bob', 'course': 'Physics', 'date_of_admission': '2023-01-10', 'fee': 10000},
    {'roll_no': 2, 'name': 'Brian', 'father': 'Steve', 'course': 'Chemistry', 'date_of_admission': '2023-02-12', 'fee': 11000},
    {'roll_no': 3, 'name': 'Chloe', 'father': 'Tim', 'course': 'Biology', 'date_of_admission': '2023-03-14', 'fee': 12000},
    {'roll_no': 4, 'name': 'David', 'father': 'Rick', 'course': 'Physics', 'date_of_admission': '2023-04-10', 'fee': 13000},
    {'roll_no': 5, 'name': 'Eva', 'father': 'John', 'course': 'Physics', 'date_of_admission': '2023-05-16', 'fee': 14000},
    {'roll_no': 6, 'name': 'Frank', 'father': 'Tom', 'course': 'Economics', 'date_of_admission': '2023-06-21', 'fee': 15000},
    {'roll_no': 7, 'name': 'Grace', 'father': 'Harry', 'course': 'History', 'date_of_admission': '2023-07-25', 'fee': 16000},
    {'roll_no': 8, 'name': 'Henry', 'father': 'Charles', 'course': 'Geography', 'date_of_admission': '2023-08-17', 'fee': 17000},
    {'roll_no': 9, 'name': 'Isabel', 'father': 'Oliver', 'course': 'English', 'date_of_admission': '2023-09-10', 'fee': 18000},
    {'roll_no': 10, 'name': 'Jack', 'father': 'Noah', 'course': 'Art', 'date_of_admission': '2023-10-05', 'fee': 19000},
]

# Create the DataFrame
students_df = pd.DataFrame(students_data)

# Convert 'date_of_admission' to datetime
students_df['date_of_admission'] = pd.to_datetime(students_df['date_of_admission'])

# Define the schema using DataFrameSchema
student_schema = pa.DataFrameSchema({
    "roll_no": Column(int, checks=Check.ge(1)),
    "name": Column(str, nullable=False),
    "father": Column(str, nullable=False),
    "course": Column(str, nullable=False),
    "date_of_admission": Column(
        pd.Timestamp, 
        checks=Check.le(datetime.now())
    ),
    "fee": Column(int, checks=Check.ge(0)),
})

# Validate the DataFrame
validated_df = student_schema.validate(students_df)

# Display the validated DataFrame
print(validated_df)

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    Physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

# Applying Filter or Filter Functions on DataFrame

In [14]:
students_df.head(1) # shows one row to look into architecture

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000

In [15]:
# function value_count, to get count against unique value, also can be put on ay column
students_df.course.value_counts()

course
Physics      3
Chemistry    1
Biology      1
Economics    1
History      1
Geography    1
English      1
Art          1
Name: count, dtype: int64

In [16]:
students_df.course.value_counts(dropna=False) # also counts null cells values

course
Physics      3
Chemistry    1
Biology      1
Economics    1
History      1
Geography    1
English      1
Art          1
Name: count, dtype: int64

In [17]:
students_df.course.value_counts(dropna=False, normalize= True) # turn values to ration or percentage and shows in count

course
Physics      0.3
Chemistry    0.1
Biology      0.1
Economics    0.1
History      0.1
Geography    0.1
English      0.1
Art          0.1
Name: proportion, dtype: float64

In [18]:
# in real percentage
students_df.course.value_counts(dropna=False, normalize= True) * 100 # also counts null cells values

course
Physics      30.0
Chemistry    10.0
Biology      10.0
Economics    10.0
History      10.0
Geography    10.0
English      10.0
Art          10.0
Name: proportion, dtype: float64

In [20]:
students_df

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    Physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

In [ ]:
# Example in bank every year why increase fee and it is being checked which slab is having more transactions
# so it can do so its very pofitable and beneficial

In [21]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

# Set a seed for reproducibility
np.random.seed(0)

# Define the number of transactions
num_transactions = 1000

# Generate random dates within the current year
current_year = datetime.now().year
start_date = datetime(current_year, 1, 1)
end_date = datetime.now()

# Generate a list of random dates within the year
random_dates = [start_date + timedelta(days=np.random.randint(0, (end_date - start_date).days))
                for _ in range(num_transactions)]

# Generate a list of random fee amounts
random_fees = np.random.randint(low=1, high=5000, size=num_transactions)

# Create the DataFrame
fee_transactions = pd.DataFrame({
    'date': random_dates,
    'fee': random_fees
})

# Sort by date for readability
fee_transactions.sort_values('date', inplace=True)

# Reset index after sorting
fee_transactions.reset_index(drop=True, inplace=True)

print(fee_transactions)

          date   fee
0   2024-01-01  1229
1   2024-01-01  3442
2   2024-01-01  4073
3   2024-01-01  3294
4   2024-01-01  4864
..         ...   ...
995 2024-08-03  3645
996 2024-08-03  2475
997 2024-08-04  1219
998 2024-08-04  1891
999 2024-08-04  4327

[1000 rows x 2 columns]

In [22]:
pd.cut(fee_transactions.fee, [1, 500, 1000, 4000, 5000])

0      (1000, 4000]
1      (1000, 4000]
2      (4000, 5000]
3      (1000, 4000]
4      (4000, 5000]
           ...
995    (1000, 4000]
996    (1000, 4000]
997    (1000, 4000]
998    (1000, 4000]
999    (4000, 5000]
Name: fee, Length: 1000, dtype: category
Categories (4, interval[int64, right]): [(1, 500] < (500, 1000] < (1000, 4000] < (4000, 5000]]

In [24]:
pd.cut(fee_transactions.fee, [1, 500, 1000, 4000, 5000]).value_counts()

fee
(1000, 4000]    624
(4000, 5000]    198
(1, 500]         98
(500, 1000]      80
Name: count, dtype: int64

In [25]:
# with percentages
pd.cut(fee_transactions.fee, [1, 500, 1000, 4000, 5000]).value_counts(normalize = True) * 100

fee
(1000, 4000]    62.4
(4000, 5000]    19.8
(1, 500]         9.8
(500, 1000]      8.0
Name: proportion, dtype: float64

In [26]:
# In percentile
pd.qcut(fee_transactions.fee, [0.3, .5, .7, .9, 1])

0                     NaN
1        (2502.0, 3536.3]
2        (3536.3, 4471.1]
3        (2502.0, 3536.3]
4        (4471.1, 4998.0]
              ...
995      (3536.3, 4471.1]
996    (1560.299, 2502.0]
997                   NaN
998    (1560.299, 2502.0]
999      (3536.3, 4471.1]
Name: fee, Length: 1000, dtype: category
Categories (4, interval[float64, right]): [(1560.299, 2502.0] < (2502.0, 3536.3] < (3536.3, 4471.1] < (4471.1, 4998.0]]

In [29]:
pd.qcut(fee_transactions.fee, [0, 0.3, .5, .7, .9, 1]).value_counts() # range , value count only applies on series we pick 1 particular column and apply

fee
(7.999, 1560.3]     300
(1560.3, 2502.0]    200
(2502.0, 3536.3]    200
(3536.3, 4471.1]    200
(4471.1, 4998.0]    100
Name: count, dtype: int64

In [ ]:
# Operations for performing filtering

In [30]:
students_df.head()

   roll_no   name father     course date_of_admission    fee
0        1  Alice    Bob    Physics        2023-01-10  10000
1        2  Brian  Steve  Chemistry        2023-02-12  11000
2        3  Chloe    Tim    Biology        2023-03-14  12000
3        4  David   Rick    Physics        2023-04-10  13000
4        5    Eva   John    Physics        2023-05-16  14000

# Filter on Columns
* & , |, ~
* Syntax:
````
dataFrame[(dataframe.column1=='value') & (dataframe.column2 == 'value2)]
````
* string columns
* numeric columns
* datetime columns

In [36]:
students_df.head(10)

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    Physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

In [38]:
students_df['course']=='Physics'

0     True
1    False
2    False
3     True
4     True
5    False
6    False
7    False
8    False
9    False
Name: course, dtype: bool

In [39]:
students_df[students_df['course']=='Physics']

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000
3        4  David   Rick  Physics        2023-04-10  13000
4        5    Eva   John  Physics        2023-05-16  14000